# Pandas for Data Analysis and Manipulation

Pandas is a Python package for data analysis and data manipulation

## Install Pandas

conda install pandas

or

pip install pandas

In [1]:
import pandas as pd

### Types in Pandas

- Pandas Series
- Pandas DataFrame

In [2]:
index = ['index_one','index_two','index_three']
my_list = [1,2,3]

In [3]:
my_series = pd.Series(my_list,index) # One-dimensional ndarray with axis labels

In [4]:
my_series

index_one      1
index_two      2
index_three    3
dtype: int64

In [5]:
my_series[0]

1

In [6]:
my_series.index

Index(['index_one', 'index_two', 'index_three'], dtype='object')

In [7]:
my_series['index_one']

1

In [8]:
type(my_series)

pandas.core.series.Series

In [9]:
my_series.max()

3

In [10]:
my_series.min()

1

In [11]:
series2 = pd.Series([1,2,5,4],index = 
                 ['index_one', 'index_two','index_three', 'index_four'])

In [12]:
series2

index_one      1
index_two      2
index_three    5
index_four     4
dtype: int64

In [13]:
my_series

index_one      1
index_two      2
index_three    3
dtype: int64

In [14]:
my_series + series2

index_four     NaN
index_one      2.0
index_three    8.0
index_two      4.0
dtype: float64

In [15]:
my_series / series2

index_four     NaN
index_one      1.0
index_three    0.6
index_two      1.0
dtype: float64

In [16]:
my_series % series2

index_four     NaN
index_one      0.0
index_three    3.0
index_two      0.0
dtype: float64

In [17]:
my_series * series2

index_four      NaN
index_one       1.0
index_three    15.0
index_two       4.0
dtype: float64

In [18]:
import numpy as np

In [24]:
names_dict ={
    'Name':['Ken','Jeff','John','Mike','Andrew','Ann','Sylvia','Dorothy','Emily','Loyford'],
    'Age':[31,52,56,12,45,np.nan,78,85,46,135],
    'Phone':[52,79,80,75,43,125,74,44,85,45],
    'Uni':['One','Two','Three','One','Two','Three','One','Two','Three','One']
}

In [25]:
df = pd.DataFrame(names_dict)

In [26]:
df.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     9 non-null      float64
 2   Phone   10 non-null     int64
 3   Uni     10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [28]:
df.describe()

              Age       Phone
count    9.000000   10.000000
mean    60.000000   70.200000
std     35.742132   25.441873
min     12.000000   43.000000
25%     45.000000   46.750000
50%     52.000000   74.500000
75%     78.000000   79.750000
max    135.000000  125.000000

In [30]:
df.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [29]:
df.iloc[0]

Name      Ken
Age      31.0
Phone      52
Uni       One
Name: 0, dtype: object

In [31]:
df['Name']

0        Ken
1       Jeff
2       John
3       Mike
4     Andrew
5        Ann
6     Sylvia
7    Dorothy
8      Emily
9    Loyford
Name: Name, dtype: object

In [32]:
df[['Name']]

      Name
0      Ken
1     Jeff
2     John
3     Mike
4   Andrew
5      Ann
6   Sylvia
7  Dorothy
8    Emily
9  Loyford

In [41]:
df['Name'].value_counts()

Jeff       1
Andrew     1
Ken        1
Emily      1
Loyford    1
Sylvia     1
Dorothy    1
John       1
Ann        1
Mike       1
Name: Name, dtype: int64

In [42]:
df[['Name']].value_counts()

Name
Andrew     1
Ann        1
Dorothy    1
Emily      1
Jeff       1
John       1
Ken        1
Loyford    1
Mike       1
Sylvia     1
dtype: int64

In [43]:
df.isnull().any()

Name     False
Age       True
Phone    False
Uni      False
dtype: bool

In [45]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [46]:
df.isnull().any()

Name     False
Age      False
Phone    False
Uni      False
dtype: bool

In [47]:
df.drop('Age', axis=1) # Axis 1 is columns, Axis 0 is rows

      Name  Phone    Uni
0      Ken     52    One
1     Jeff     79    Two
2     John     80  Three
3     Mike     75    One
4   Andrew     43    Two
5      Ann    125  Three
6   Sylvia     74    One
7  Dorothy     44    Two
8    Emily     85  Three
9  Loyford     45    One

In [48]:
df.head()

     Name   Age  Phone    Uni
0     Ken  31.0     52    One
1    Jeff  52.0     79    Two
2    John  56.0     80  Three
3    Mike  12.0     75    One
4  Andrew  45.0     43    Two

In [49]:
df['times'] = df['Age'] * df['Phone']

In [50]:
df.head()

     Name   Age  Phone    Uni   times
0     Ken  31.0     52    One  1612.0
1    Jeff  52.0     79    Two  4108.0
2    John  56.0     80  Three  4480.0
3    Mike  12.0     75    One   900.0
4  Andrew  45.0     43    Two  1935.0

In [51]:
df[ df['Age'] > 20  ]

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   60.0    125  Three  7500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

In [52]:
df[ df['Name'] == 'Ken' ]

  Name   Age  Phone  Uni   times
0  Ken  31.0     52  One  1612.0

In [53]:
df[ (df['Age'] > 20) & (df['Phone'] > 40) ]

      Name    Age  Phone    Uni   times
0      Ken   31.0     52    One  1612.0
1     Jeff   52.0     79    Two  4108.0
2     John   56.0     80  Three  4480.0
4   Andrew   45.0     43    Two  1935.0
5      Ann   60.0    125  Three  7500.0
6   Sylvia   78.0     74    One  5772.0
7  Dorothy   85.0     44    Two  3740.0
8    Emily   46.0     85  Three  3910.0
9  Loyford  135.0     45    One  6075.0

In [56]:
group = df.groupby(['Uni'])['Age'].mean().sort_values(ascending=False).reset_index()

In [59]:
group.to_csv('names_with_index.csv') # index=True by default
group.to_csv('names.csv',index=False)
group.to_excel('names.xlsx',index=False)
group.to_json('data.json')

In [60]:
data = pd.read_excel("names.xlsx")

In [61]:
data.head()

     Uni        Age
0    One  64.000000
1    Two  60.666667
2  Three  54.000000

In [62]:
names = pd.read_csv("names.csv")
json = pd.read_json("data.json")

In [63]:
pd.pivot_table(df, values='Age',columns=['Uni'],aggfunc='mean')

Uni   One  Three        Two
Age  64.0   54.0  60.666667